{
  "1": {
    "title": "Christmas Countdown",
    "detail": "UI Extension with live updating ticker of days, hours, minutes and seconds until Christmas day",
    "symbol": "⏰",
    "image": "01-christmas-countdown.gif"
  },
  "2": {
    "title": "Compact Countdown",
    "detail": "Our first feature is up! But it's a bit big for some users. We want to provide an option for them to install a more compact version of the card that can be used in the sidebar for a less in-your-face experience.",
    "image": "02-compact-countdown.png",
    "symbol": "⌛"
  },
  "3": {
    "title": "Holiday Humor",
    "detail": "A simple feature that we'll use to keep the mood light during this challenge and the holiday season in general. We'll pull holiday-specific jokes from an API and display them in a CRM card that can work in the sidebar or the middle pane.",
    "image": "03-holiday-humor.png",
    "symbol": "🤣"
  },
  "4": {
    "title": "Advent Calendar",
    "detail": "Today I'm going to take inspiration from what @sejal built during her first two days of the challenge: a pretty kick-ass calendar view of the days leading up the Christmas. However, rather than having this calendar serve as the countdown, I'm going to use it as a way to self-document each feature built per-day, and list them right on the calendar day entries themselves.",
    "image": "04-advent-calendar.png",
    "symbol": "📅"
  },
  "5": {
    "title": "Secret Santa",
    "detail": "Today I'm going to take inspiration from what @sejal built during her first two days of the challenge: a pretty kick-ass calendar view of the days leading up the Christmas. However, rather than having this calendar serve as the countdown, I'm going to use it as a way to self-document each feature built per-day, and list them right on the calendar day entries themselves.",
    "image": "05-secret-santa.png",
    "symbol": "asset:secret-santa.png"
  },
  "15": null,
  "16": {
    "title": "The Gift of Script",
    "detail": "So far, I've been uploading the preview image for each example to GitHub, and then coming back into the source afterward to use the GitHub-generated URL for the image to show a preview in the Project Details Panel. Not a great workflow. It's time to help ourselves by using a little scripting magic to store those images right in our own portal's Filemanager, which also lets us have the image URLs ready to go when we hit publish rather than needing a followup task to clean that up.",
    "image": "16-gift-of-script.png",
    "symbol": "🤖"
  }
}
